Resolved Issue 203

In [2]:
import pandas as pd
df = pd.read_excel("data1.xlsx")
df

,Unnamed: 0,ord_no,purch_amt,sales_amt,order_date,customer_id,salesman_id
0,0,70001.0,150.50,10.50,2012-10-05,3002,5002.0
1,1,NaN,NaN,20.65,2012-09-10,3001,5003.0
2,2,70002.0,65.26,NaN,NaT,3001,5001.0
3,3,70004.0,110.50,11.50,2012-08-17,3003,NaN
4,4,NaN,948.50,98.50,2012-09-10,3002,5002.0
5,5,70005.0,NaN,NaN,2012-07-27,3001,5001.0
6,6,NaN,5760.00,57.00,2012-09-10,3001,5001.0
7,7,70010.0,1983.00,19.43,2012-10-10,3004,NaN
8,8,70003.0,NaN,NaN,2012-10-10,3003,5003.0
9,9,70012.0,250.45,25.45,2012-06-27,3002,5002.0
10,10,NaN,75.29,75.29,2012-08-17,3001,5003.0
11,11,70013.0,3045.60,35.60,2012-04-25,3001,NaN

The total number of missing values.

In [4]:
import pandas as pd
df = pd.read_excel("data1.xlsx")
df.isnull().sum().sum()

14

The indices of missing values in each column

In [5]:
import pandas as pd
df = pd.read_excel("data1.xlsx")
for column in df.columns:
    missing_indices = df.index[df[column].isnull()].tolist()
    print(f"Missing indices for column '{column}': {missing_indices}")

Missing indices for column 'Unnamed: 0': []
Missing indices for column 'ord_no': [1, 4, 6, 10]
Missing indices for column 'purch_amt': [1, 5, 8]
Missing indices for column 'sales_amt': [2, 5, 8]
Missing indices for column 'order_date': [2]
Missing indices for column 'customer_id': []
Missing indices for column 'salesman_id': [3, 7, 11]

replace all the missing values by mean

In [13]:
import pandas as pd
df = pd.read_excel("data1.xlsx")
df = df.fillna(df.mean(numeric_only=True), inplace=True)

replace all the missing values by median

In [14]:
import pandas as pd
df = pd.read_excel("data1.xlsx")
df = df.fillna(df.median(numeric_only=True), inplace=True)

replace all the missing values by most frequent value

In [ ]:
import pandas as pd
df = pd.read_excel("data1.xlsx")
df.fillna(df.mode().iloc[0], inplace=True)